zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CPE_VFCCU.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CPE_VFCCU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CPE_VFCCU_H_)  /* Check if memory map has not been already included */
#define S32K566_CPE_VFCCU_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CPE_VFCCU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_VFCCU_Peripheral_Access_Layer CPE_VFCCU Peripheral Access Layer
 * @{
 */

/** CPE_VFCCU - Register Layout Typedef */
typedef struct CPE_VFCCU_Struct {
  uint8_t RESERVED_0[1024];
  __IO uint32_t GFLTPO_C0;                         /**< Global Fault Polarity, offset: 0x400 */
  __IO uint32_t GFLTPO_C1;                         /**< Global Fault Polarity, offset: 0x404 */
  uint8_t RESERVED_1[56];
  __IO uint32_t GFLTRC_C0;                         /**< Global Fault Recovery, offset: 0x440 */
  __IO uint32_t GFLTRC_C1;                         /**< Global Fault Recovery, offset: 0x444 */
  uint8_t RESERVED_2[2240];
  __I  uint32_t GINTOVFS;                          /**< Global DID FSM Status, offset: 0xD08 */
  uint8_t RESERVED_3[676];
  __IO uint32_t GDBGCFG;                           /**< Global Debug, offset: 0xFB0 */
  __I  uint32_t GDBGSTAT;                          /**< Global Debug Status, offset: 0xFB4 */
  uint8_t RESERVED_4[72];
  __IO uint32_t FHCFG0;                            /**< Fault Handler, offset: 0x1000 */
  __I  uint32_t FHSRVDS0;                          /**< Fault Handler Status, offset: 0x1004 */
  uint8_t RESERVED_5[8];
  __IO uint32_t FHFLTENC0_0;                       /**< Fault Enable, offset: 0x1010 */
  __IO uint32_t FHFLTENC0_1;                       /**< Fault Enable, offset: 0x1014 */
  uint8_t RESERVED_6[56];
  __IO uint32_t FHFLTS0_0;                         /**< Fault Status, offset: 0x1050 */
  __IO uint32_t FHFLTS0_1;                         /**< Fault Status, offset: 0x1054 */
  uint8_t RESERVED_7[56];
  __IO uint32_t FHFLTRKC0_0;                       /**< Fault Reaction Set Configuration, offset: 0x1090 */
  __IO uint32_t FHFLTRKC0_1;                       /**< Fault Reaction Set Configuration, offset: 0x1094 */
  __IO uint32_t FHFLTRKC0_2;                       /**< Fault Reaction Set Configuration, offset: 0x1098 */
  __IO uint32_t FHFLTRKC0_3;                       /**< Fault Reaction Set Configuration, offset: 0x109C */
  __IO uint32_t FHFLTRKC0_4;                       /**< Fault Reaction Set Configuration, offset: 0x10A0 */
  __IO uint32_t FHFLTRKC0_5;                       /**< Fault Reaction Set Configuration, offset: 0x10A4 */
  __IO uint32_t FHFLTRKC0_6;                       /**< Fault Reaction Set Configuration, offset: 0x10A8 */
  __IO uint32_t FHFLTRKC0_7;                       /**< Fault Reaction Set Configuration, offset: 0x10AC */
  __IO uint32_t FHFLTRKC0_8;                       /**< Fault Reaction Set Configuration, offset: 0x10B0 */
  __IO uint32_t FHFLTRKC0_9;                       /**< Fault Reaction Set Configuration, offset: 0x10B4 */
  __IO uint32_t FHFLTRKC0_10;                      /**< Fault Reaction Set Configuration, offset: 0x10B8 */
  __IO uint32_t FHFLTRKC0_11;                      /**< Fault Reaction Set Configuration, offset: 0x10BC */
  __IO uint32_t FHFLTRKC0_12;                      /**< Fault Reaction Set Configuration, offset: 0x10C0 */
  __IO uint32_t FHFLTRKC0_13;                      /**< Fault Reaction Set Configuration, offset: 0x10C4 */
  __IO uint32_t FHFLTRKC0_14;                      /**< Fault Reaction Set Configuration, offset: 0x10C8 */
  __IO uint32_t FHFLTRKC0_15;                      /**< Fault Reaction Set Configuration, offset: 0x10CC */
  uint8_t RESERVED_8[448];
  __IO uint32_t FHIMRKC0_00;                       /**< Immediate Reaction Configuration, offset: 0x1290 */
  uint8_t RESERVED_9[28];
  __IO uint32_t FHIMRKC0_10;                       /**< Immediate Reaction Configuration, offset: 0x12B0 */
  uint8_t RESERVED_10[28];
  __IO uint32_t FHIMRKC0_20;                       /**< Immediate Reaction Configuration, offset: 0x12D0 */
  uint8_t RESERVED_11[28];
  __IO uint32_t FHIMRKC0_30;                       /**< Immediate Reaction Configuration, offset: 0x12F0 */
  uint8_t RESERVED_12[28];
  __IO uint32_t FHIMRKC0_40;                       /**< Immediate Reaction Configuration, offset: 0x1310 */
  uint8_t RESERVED_13[28];
  __IO uint32_t FHIMRKC0_50;                       /**< Immediate Reaction Configuration, offset: 0x1330 */
  uint8_t RESERVED_14[28];
  __IO uint32_t FHIMRKC0_60;                       /**< Immediate Reaction Configuration, offset: 0x1350 */
  uint8_t RESERVED_15[28];
  __IO uint32_t FHIMRKC0_70;                       /**< Immediate Reaction Configuration, offset: 0x1370 */
} CPE_VFCCU_Type, *CPE_VFCCU_MemMapPtr;

/** Number of instances of the CPE_VFCCU module. */
#define CPE_VFCCU_INSTANCE_COUNT                 (1u)

/* CPE_VFCCU - Peripheral instance base addresses */
/** Peripheral CPE_VFCCU base address */
#define IP_CPE_VFCCU_BASE                        (0x41098000u)
/** Peripheral CPE_VFCCU base pointer */
#define IP_CPE_VFCCU                             ((CPE_VFCCU_Type *)IP_CPE_VFCCU_BASE)
/** Array initializer of CPE_VFCCU peripheral base addresses */
#define IP_CPE_VFCCU_BASE_ADDRS                  { IP_CPE_VFCCU_BASE }
/** Array initializer of CPE_VFCCU peripheral base pointers */
#define IP_CPE_VFCCU_BASE_PTRS                   { IP_CPE_VFCCU }

/* ----------------------------------------------------------------------------
   -- CPE_VFCCU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_VFCCU_Register_Masks CPE_VFCCU Register Masks
 * @{
 */

/*! @name GFLTPO_C0 - Global Fault Polarity */
/*! @{ */

#define CPE_VFCCU_GFLTPO_C0_PS0_MASK             (0x1U)
#define CPE_VFCCU_GFLTPO_C0_PS0_SHIFT            (0U)
#define CPE_VFCCU_GFLTPO_C0_PS0_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS0_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS0_MASK)

