zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_GFLTPO_C0_PS1_MASK             (0x2U)
#define CPE_VFCCU_GFLTPO_C0_PS1_SHIFT            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS1_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS1_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS1_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS2_MASK             (0x4U)
#define CPE_VFCCU_GFLTPO_C0_PS2_SHIFT            (2U)
#define CPE_VFCCU_GFLTPO_C0_PS2_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS2_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS2_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS3_MASK             (0x8U)
#define CPE_VFCCU_GFLTPO_C0_PS3_SHIFT            (3U)
#define CPE_VFCCU_GFLTPO_C0_PS3_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS3_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS3_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS4_MASK             (0x10U)
#define CPE_VFCCU_GFLTPO_C0_PS4_SHIFT            (4U)
#define CPE_VFCCU_GFLTPO_C0_PS4_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS4(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS4_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS4_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS5_MASK             (0x20U)
#define CPE_VFCCU_GFLTPO_C0_PS5_SHIFT            (5U)
#define CPE_VFCCU_GFLTPO_C0_PS5_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS5(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS5_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS5_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS6_MASK             (0x40U)
#define CPE_VFCCU_GFLTPO_C0_PS6_SHIFT            (6U)
#define CPE_VFCCU_GFLTPO_C0_PS6_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS6(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS6_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS6_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS7_MASK             (0x80U)
#define CPE_VFCCU_GFLTPO_C0_PS7_SHIFT            (7U)
#define CPE_VFCCU_GFLTPO_C0_PS7_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS7(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS7_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS7_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS8_MASK             (0x100U)
#define CPE_VFCCU_GFLTPO_C0_PS8_SHIFT            (8U)
#define CPE_VFCCU_GFLTPO_C0_PS8_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS8(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS8_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS8_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS9_MASK             (0x200U)
#define CPE_VFCCU_GFLTPO_C0_PS9_SHIFT            (9U)
#define CPE_VFCCU_GFLTPO_C0_PS9_WIDTH            (1U)
#define CPE_VFCCU_GFLTPO_C0_PS9(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS9_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS9_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS10_MASK            (0x400U)
#define CPE_VFCCU_GFLTPO_C0_PS10_SHIFT           (10U)
#define CPE_VFCCU_GFLTPO_C0_PS10_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS10(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS10_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS10_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS11_MASK            (0x800U)
#define CPE_VFCCU_GFLTPO_C0_PS11_SHIFT           (11U)
#define CPE_VFCCU_GFLTPO_C0_PS11_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS11(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS11_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS11_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS12_MASK            (0x1000U)
#define CPE_VFCCU_GFLTPO_C0_PS12_SHIFT           (12U)
#define CPE_VFCCU_GFLTPO_C0_PS12_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS12(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS12_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS12_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS13_MASK            (0x2000U)
#define CPE_VFCCU_GFLTPO_C0_PS13_SHIFT           (13U)
#define CPE_VFCCU_GFLTPO_C0_PS13_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS13(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS13_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS13_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS14_MASK            (0x4000U)
#define CPE_VFCCU_GFLTPO_C0_PS14_SHIFT           (14U)
#define CPE_VFCCU_GFLTPO_C0_PS14_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS14(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS14_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS14_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS15_MASK            (0x8000U)
#define CPE_VFCCU_GFLTPO_C0_PS15_SHIFT           (15U)
#define CPE_VFCCU_GFLTPO_C0_PS15_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS15(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS15_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS15_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS16_MASK            (0x10000U)
#define CPE_VFCCU_GFLTPO_C0_PS16_SHIFT           (16U)
#define CPE_VFCCU_GFLTPO_C0_PS16_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS16(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS16_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS16_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS17_MASK            (0x20000U)
#define CPE_VFCCU_GFLTPO_C0_PS17_SHIFT           (17U)
#define CPE_VFCCU_GFLTPO_C0_PS17_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS17(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS17_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS17_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS18_MASK            (0x40000U)
#define CPE_VFCCU_GFLTPO_C0_PS18_SHIFT           (18U)
#define CPE_VFCCU_GFLTPO_C0_PS18_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS18(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS18_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS18_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS19_MASK            (0x80000U)
#define CPE_VFCCU_GFLTPO_C0_PS19_SHIFT           (19U)
#define CPE_VFCCU_GFLTPO_C0_PS19_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS19(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS19_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS19_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS20_MASK            (0x100000U)
#define CPE_VFCCU_GFLTPO_C0_PS20_SHIFT           (20U)
#define CPE_VFCCU_GFLTPO_C0_PS20_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS20(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS20_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS20_MASK)

