zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_GFLTPO_C0_PS21_MASK            (0x200000U)
#define CPE_VFCCU_GFLTPO_C0_PS21_SHIFT           (21U)
#define CPE_VFCCU_GFLTPO_C0_PS21_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS21(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS21_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS21_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS22_MASK            (0x400000U)
#define CPE_VFCCU_GFLTPO_C0_PS22_SHIFT           (22U)
#define CPE_VFCCU_GFLTPO_C0_PS22_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS22(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS22_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS22_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS23_MASK            (0x800000U)
#define CPE_VFCCU_GFLTPO_C0_PS23_SHIFT           (23U)
#define CPE_VFCCU_GFLTPO_C0_PS23_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS23(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS23_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS23_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS24_MASK            (0x1000000U)
#define CPE_VFCCU_GFLTPO_C0_PS24_SHIFT           (24U)
#define CPE_VFCCU_GFLTPO_C0_PS24_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS24(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS24_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS24_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS25_MASK            (0x2000000U)
#define CPE_VFCCU_GFLTPO_C0_PS25_SHIFT           (25U)
#define CPE_VFCCU_GFLTPO_C0_PS25_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS25(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS25_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS25_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS26_MASK            (0x4000000U)
#define CPE_VFCCU_GFLTPO_C0_PS26_SHIFT           (26U)
#define CPE_VFCCU_GFLTPO_C0_PS26_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS26(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS26_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS26_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS27_MASK            (0x8000000U)
#define CPE_VFCCU_GFLTPO_C0_PS27_SHIFT           (27U)
#define CPE_VFCCU_GFLTPO_C0_PS27_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS27(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS27_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS27_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS28_MASK            (0x10000000U)
#define CPE_VFCCU_GFLTPO_C0_PS28_SHIFT           (28U)
#define CPE_VFCCU_GFLTPO_C0_PS28_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS28(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS28_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS28_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS29_MASK            (0x20000000U)
#define CPE_VFCCU_GFLTPO_C0_PS29_SHIFT           (29U)
#define CPE_VFCCU_GFLTPO_C0_PS29_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS29(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS29_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS29_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS30_MASK            (0x40000000U)
#define CPE_VFCCU_GFLTPO_C0_PS30_SHIFT           (30U)
#define CPE_VFCCU_GFLTPO_C0_PS30_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS30(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS30_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS30_MASK)

#define CPE_VFCCU_GFLTPO_C0_PS31_MASK            (0x80000000U)
#define CPE_VFCCU_GFLTPO_C0_PS31_SHIFT           (31U)
#define CPE_VFCCU_GFLTPO_C0_PS31_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C0_PS31(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C0_PS31_SHIFT)) & CPE_VFCCU_GFLTPO_C0_PS31_MASK)
/*! @} */

/*! @name GFLTPO_C1 - Global Fault Polarity */
/*! @{ */

#define CPE_VFCCU_GFLTPO_C1_PS32_MASK            (0x1U)
#define CPE_VFCCU_GFLTPO_C1_PS32_SHIFT           (0U)
#define CPE_VFCCU_GFLTPO_C1_PS32_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS32(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS32_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS32_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS33_MASK            (0x2U)
#define CPE_VFCCU_GFLTPO_C1_PS33_SHIFT           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS33_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS33(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS33_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS33_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS34_MASK            (0x4U)
#define CPE_VFCCU_GFLTPO_C1_PS34_SHIFT           (2U)
#define CPE_VFCCU_GFLTPO_C1_PS34_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS34(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS34_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS34_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS35_MASK            (0x8U)
#define CPE_VFCCU_GFLTPO_C1_PS35_SHIFT           (3U)
#define CPE_VFCCU_GFLTPO_C1_PS35_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS35(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS35_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS35_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS36_MASK            (0x10U)
#define CPE_VFCCU_GFLTPO_C1_PS36_SHIFT           (4U)
#define CPE_VFCCU_GFLTPO_C1_PS36_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS36(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS36_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS36_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS37_MASK            (0x20U)
#define CPE_VFCCU_GFLTPO_C1_PS37_SHIFT           (5U)
#define CPE_VFCCU_GFLTPO_C1_PS37_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS37(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS37_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS37_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS38_MASK            (0x40U)
#define CPE_VFCCU_GFLTPO_C1_PS38_SHIFT           (6U)
#define CPE_VFCCU_GFLTPO_C1_PS38_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS38(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS38_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS38_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS39_MASK            (0x80U)
#define CPE_VFCCU_GFLTPO_C1_PS39_SHIFT           (7U)
#define CPE_VFCCU_GFLTPO_C1_PS39_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS39(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS39_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS39_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS40_MASK            (0x100U)
#define CPE_VFCCU_GFLTPO_C1_PS40_SHIFT           (8U)
#define CPE_VFCCU_GFLTPO_C1_PS40_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS40(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS40_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS40_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS41_MASK            (0x200U)
#define CPE_VFCCU_GFLTPO_C1_PS41_SHIFT           (9U)
#define CPE_VFCCU_GFLTPO_C1_PS41_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS41(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS41_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS41_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS42_MASK            (0x400U)
#define CPE_VFCCU_GFLTPO_C1_PS42_SHIFT           (10U)
#define CPE_VFCCU_GFLTPO_C1_PS42_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS42(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS42_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS42_MASK)

