zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_GFLTPO_C1_PS43_MASK            (0x800U)
#define CPE_VFCCU_GFLTPO_C1_PS43_SHIFT           (11U)
#define CPE_VFCCU_GFLTPO_C1_PS43_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS43(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS43_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS43_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS44_MASK            (0x1000U)
#define CPE_VFCCU_GFLTPO_C1_PS44_SHIFT           (12U)
#define CPE_VFCCU_GFLTPO_C1_PS44_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS44(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS44_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS44_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS45_MASK            (0x2000U)
#define CPE_VFCCU_GFLTPO_C1_PS45_SHIFT           (13U)
#define CPE_VFCCU_GFLTPO_C1_PS45_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS45(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS45_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS45_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS46_MASK            (0x4000U)
#define CPE_VFCCU_GFLTPO_C1_PS46_SHIFT           (14U)
#define CPE_VFCCU_GFLTPO_C1_PS46_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS46(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS46_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS46_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS47_MASK            (0x8000U)
#define CPE_VFCCU_GFLTPO_C1_PS47_SHIFT           (15U)
#define CPE_VFCCU_GFLTPO_C1_PS47_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS47(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS47_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS47_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS48_MASK            (0x10000U)
#define CPE_VFCCU_GFLTPO_C1_PS48_SHIFT           (16U)
#define CPE_VFCCU_GFLTPO_C1_PS48_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS48(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS48_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS48_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS49_MASK            (0x20000U)
#define CPE_VFCCU_GFLTPO_C1_PS49_SHIFT           (17U)
#define CPE_VFCCU_GFLTPO_C1_PS49_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS49(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS49_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS49_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS50_MASK            (0x40000U)
#define CPE_VFCCU_GFLTPO_C1_PS50_SHIFT           (18U)
#define CPE_VFCCU_GFLTPO_C1_PS50_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS50(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS50_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS50_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS51_MASK            (0x80000U)
#define CPE_VFCCU_GFLTPO_C1_PS51_SHIFT           (19U)
#define CPE_VFCCU_GFLTPO_C1_PS51_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS51(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS51_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS51_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS52_MASK            (0x100000U)
#define CPE_VFCCU_GFLTPO_C1_PS52_SHIFT           (20U)
#define CPE_VFCCU_GFLTPO_C1_PS52_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS52(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS52_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS52_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS53_MASK            (0x200000U)
#define CPE_VFCCU_GFLTPO_C1_PS53_SHIFT           (21U)
#define CPE_VFCCU_GFLTPO_C1_PS53_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS53(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS53_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS53_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS54_MASK            (0x400000U)
#define CPE_VFCCU_GFLTPO_C1_PS54_SHIFT           (22U)
#define CPE_VFCCU_GFLTPO_C1_PS54_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS54(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS54_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS54_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS55_MASK            (0x800000U)
#define CPE_VFCCU_GFLTPO_C1_PS55_SHIFT           (23U)
#define CPE_VFCCU_GFLTPO_C1_PS55_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS55(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS55_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS55_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS56_MASK            (0x1000000U)
#define CPE_VFCCU_GFLTPO_C1_PS56_SHIFT           (24U)
#define CPE_VFCCU_GFLTPO_C1_PS56_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS56(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS56_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS56_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS57_MASK            (0x2000000U)
#define CPE_VFCCU_GFLTPO_C1_PS57_SHIFT           (25U)
#define CPE_VFCCU_GFLTPO_C1_PS57_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS57(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS57_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS57_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS58_MASK            (0x4000000U)
#define CPE_VFCCU_GFLTPO_C1_PS58_SHIFT           (26U)
#define CPE_VFCCU_GFLTPO_C1_PS58_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS58(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS58_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS58_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS59_MASK            (0x8000000U)
#define CPE_VFCCU_GFLTPO_C1_PS59_SHIFT           (27U)
#define CPE_VFCCU_GFLTPO_C1_PS59_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS59(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS59_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS59_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS60_MASK            (0x10000000U)
#define CPE_VFCCU_GFLTPO_C1_PS60_SHIFT           (28U)
#define CPE_VFCCU_GFLTPO_C1_PS60_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS60(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS60_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS60_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS61_MASK            (0x20000000U)
#define CPE_VFCCU_GFLTPO_C1_PS61_SHIFT           (29U)
#define CPE_VFCCU_GFLTPO_C1_PS61_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS61(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS61_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS61_MASK)

