zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_GFLTPO_C1_PS62_MASK            (0x40000000U)
#define CPE_VFCCU_GFLTPO_C1_PS62_SHIFT           (30U)
#define CPE_VFCCU_GFLTPO_C1_PS62_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS62(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS62_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS62_MASK)

#define CPE_VFCCU_GFLTPO_C1_PS63_MASK            (0x80000000U)
#define CPE_VFCCU_GFLTPO_C1_PS63_SHIFT           (31U)
#define CPE_VFCCU_GFLTPO_C1_PS63_WIDTH           (1U)
#define CPE_VFCCU_GFLTPO_C1_PS63(x)              (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTPO_C1_PS63_SHIFT)) & CPE_VFCCU_GFLTPO_C1_PS63_MASK)
/*! @} */

/*! @name GFLTRC_C0 - Global Fault Recovery */
/*! @{ */

#define CPE_VFCCU_GFLTRC_C0_RHWSW0_MASK          (0x1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW0_SHIFT         (0U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW0_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW0(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW0_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW0_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW1_MASK          (0x2U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW1_SHIFT         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW1_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW1(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW1_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW1_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW2_MASK          (0x4U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW2_SHIFT         (2U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW2_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW2(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW2_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW2_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW3_MASK          (0x8U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW3_SHIFT         (3U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW3_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW3(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW3_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW3_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW4_MASK          (0x10U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW4_SHIFT         (4U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW4_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW4(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW4_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW4_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW5_MASK          (0x20U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW5_SHIFT         (5U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW5_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW5(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW5_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW5_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW6_MASK          (0x40U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW6_SHIFT         (6U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW6_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW6(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW6_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW6_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW7_MASK          (0x80U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW7_SHIFT         (7U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW7_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW7(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW7_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW7_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW8_MASK          (0x100U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW8_SHIFT         (8U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW8_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW8(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW8_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW8_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW9_MASK          (0x200U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW9_SHIFT         (9U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW9_WIDTH         (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW9(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW9_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW9_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW10_MASK         (0x400U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW10_SHIFT        (10U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW10_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW10(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW10_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW10_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW11_MASK         (0x800U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW11_SHIFT        (11U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW11_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW11(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW11_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW11_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW12_MASK         (0x1000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW12_SHIFT        (12U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW12_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW12(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW12_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW12_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW13_MASK         (0x2000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW13_SHIFT        (13U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW13_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW13(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW13_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW13_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW14_MASK         (0x4000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW14_SHIFT        (14U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW14_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW14(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW14_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW14_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW15_MASK         (0x8000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW15_SHIFT        (15U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW15_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW15(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW15_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW15_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW16_MASK         (0x10000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW16_SHIFT        (16U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW16_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW16(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW16_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW16_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW17_MASK         (0x20000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW17_SHIFT        (17U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW17_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW17(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW17_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW17_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW18_MASK         (0x40000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW18_SHIFT        (18U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW18_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW18(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW18_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW18_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW19_MASK         (0x80000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW19_SHIFT        (19U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW19_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW19(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW19_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW19_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW20_MASK         (0x100000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW20_SHIFT        (20U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW20_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW20(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW20_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW20_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW21_MASK         (0x200000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW21_SHIFT        (21U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW21_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW21(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW21_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW21_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW22_MASK         (0x400000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW22_SHIFT        (22U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW22_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW22(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW22_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW22_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW23_MASK         (0x800000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW23_SHIFT        (23U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW23_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW23(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW23_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW23_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW24_MASK         (0x1000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW24_SHIFT        (24U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW24_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW24(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW24_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW24_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW25_MASK         (0x2000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW25_SHIFT        (25U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW25_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW25(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW25_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW25_MASK)

