zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_GFLTRC_C0_RHWSW26_MASK         (0x4000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW26_SHIFT        (26U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW26_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW26(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW26_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW26_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW27_MASK         (0x8000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW27_SHIFT        (27U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW27_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW27(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW27_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW27_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW28_MASK         (0x10000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW28_SHIFT        (28U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW28_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW28(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW28_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW28_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW29_MASK         (0x20000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW29_SHIFT        (29U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW29_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW29(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW29_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW29_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW30_MASK         (0x40000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW30_SHIFT        (30U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW30_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW30(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW30_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW30_MASK)

#define CPE_VFCCU_GFLTRC_C0_RHWSW31_MASK         (0x80000000U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW31_SHIFT        (31U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW31_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C0_RHWSW31(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C0_RHWSW31_SHIFT)) & CPE_VFCCU_GFLTRC_C0_RHWSW31_MASK)
/*! @} */

/*! @name GFLTRC_C1 - Global Fault Recovery */
/*! @{ */

#define CPE_VFCCU_GFLTRC_C1_RHWSW32_MASK         (0x1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW32_SHIFT        (0U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW32_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW32(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW32_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW32_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW33_MASK         (0x2U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW33_SHIFT        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW33_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW33(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW33_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW33_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW34_MASK         (0x4U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW34_SHIFT        (2U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW34_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW34(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW34_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW34_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW35_MASK         (0x8U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW35_SHIFT        (3U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW35_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW35(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW35_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW35_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW36_MASK         (0x10U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW36_SHIFT        (4U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW36_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW36(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW36_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW36_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW37_MASK         (0x20U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW37_SHIFT        (5U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW37_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW37(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW37_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW37_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW38_MASK         (0x40U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW38_SHIFT        (6U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW38_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW38(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW38_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW38_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW39_MASK         (0x80U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW39_SHIFT        (7U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW39_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW39(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW39_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW39_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW40_MASK         (0x100U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW40_SHIFT        (8U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW40_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW40(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW40_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW40_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW41_MASK         (0x200U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW41_SHIFT        (9U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW41_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW41(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW41_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW41_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW42_MASK         (0x400U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW42_SHIFT        (10U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW42_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW42(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW42_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW42_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW43_MASK         (0x800U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW43_SHIFT        (11U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW43_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW43(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW43_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW43_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW44_MASK         (0x1000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW44_SHIFT        (12U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW44_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW44(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW44_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW44_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW45_MASK         (0x2000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW45_SHIFT        (13U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW45_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW45(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW45_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW45_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW46_MASK         (0x4000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW46_SHIFT        (14U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW46_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW46(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW46_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW46_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW47_MASK         (0x8000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW47_SHIFT        (15U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW47_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW47(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW47_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW47_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW48_MASK         (0x10000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW48_SHIFT        (16U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW48_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW48(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW48_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW48_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW49_MASK         (0x20000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW49_SHIFT        (17U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW49_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW49(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW49_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW49_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW50_MASK         (0x40000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW50_SHIFT        (18U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW50_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW50(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW50_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW50_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW51_MASK         (0x80000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW51_SHIFT        (19U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW51_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW51(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW51_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW51_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW52_MASK         (0x100000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW52_SHIFT        (20U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW52_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW52(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW52_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW52_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW53_MASK         (0x200000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW53_SHIFT        (21U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW53_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW53(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW53_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW53_MASK)

