zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_GFLTRC_C1_RHWSW54_MASK         (0x400000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW54_SHIFT        (22U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW54_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW54(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW54_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW54_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW55_MASK         (0x800000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW55_SHIFT        (23U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW55_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW55(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW55_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW55_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW56_MASK         (0x1000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW56_SHIFT        (24U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW56_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW56(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW56_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW56_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW57_MASK         (0x2000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW57_SHIFT        (25U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW57_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW57(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW57_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW57_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW58_MASK         (0x4000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW58_SHIFT        (26U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW58_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW58(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW58_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW58_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW59_MASK         (0x8000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW59_SHIFT        (27U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW59_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW59(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW59_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW59_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW60_MASK         (0x10000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW60_SHIFT        (28U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW60_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW60(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW60_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW60_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW61_MASK         (0x20000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW61_SHIFT        (29U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW61_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW61(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW61_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW61_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW62_MASK         (0x40000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW62_SHIFT        (30U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW62_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW62(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW62_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW62_MASK)

#define CPE_VFCCU_GFLTRC_C1_RHWSW63_MASK         (0x80000000U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW63_SHIFT        (31U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW63_WIDTH        (1U)
#define CPE_VFCCU_GFLTRC_C1_RHWSW63(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GFLTRC_C1_RHWSW63_SHIFT)) & CPE_VFCCU_GFLTRC_C1_RHWSW63_MASK)
/*! @} */

/*! @name GINTOVFS - Global DID FSM Status */
/*! @{ */

#define CPE_VFCCU_GINTOVFS_FLTSERV_MASK          (0x80U)
#define CPE_VFCCU_GINTOVFS_FLTSERV_SHIFT         (7U)
#define CPE_VFCCU_GINTOVFS_FLTSERV_WIDTH         (1U)
#define CPE_VFCCU_GINTOVFS_FLTSERV(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GINTOVFS_FLTSERV_SHIFT)) & CPE_VFCCU_GINTOVFS_FLTSERV_MASK)

#define CPE_VFCCU_GINTOVFS_SERV_DID_MASK         (0xF0000U)
#define CPE_VFCCU_GINTOVFS_SERV_DID_SHIFT        (16U)
#define CPE_VFCCU_GINTOVFS_SERV_DID_WIDTH        (4U)
#define CPE_VFCCU_GINTOVFS_SERV_DID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GINTOVFS_SERV_DID_SHIFT)) & CPE_VFCCU_GINTOVFS_SERV_DID_MASK)
/*! @} */

/*! @name GDBGCFG - Global Debug */
/*! @{ */

#define CPE_VFCCU_GDBGCFG_FRZ_MASK               (0x10000U)
#define CPE_VFCCU_GDBGCFG_FRZ_SHIFT              (16U)
#define CPE_VFCCU_GDBGCFG_FRZ_WIDTH              (1U)
#define CPE_VFCCU_GDBGCFG_FRZ(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GDBGCFG_FRZ_SHIFT)) & CPE_VFCCU_GDBGCFG_FRZ_MASK)
/*! @} */

/*! @name GDBGSTAT - Global Debug Status */
/*! @{ */

#define CPE_VFCCU_GDBGSTAT_FLTIND_MASK           (0xFFU)
#define CPE_VFCCU_GDBGSTAT_FLTIND_SHIFT          (0U)
#define CPE_VFCCU_GDBGSTAT_FLTIND_WIDTH          (8U)
#define CPE_VFCCU_GDBGSTAT_FLTIND(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GDBGSTAT_FLTIND_SHIFT)) & CPE_VFCCU_GDBGSTAT_FLTIND_MASK)

#define CPE_VFCCU_GDBGSTAT_RKN_ACK_MASK          (0x40000000U)
#define CPE_VFCCU_GDBGSTAT_RKN_ACK_SHIFT         (30U)
#define CPE_VFCCU_GDBGSTAT_RKN_ACK_WIDTH         (1U)
#define CPE_VFCCU_GDBGSTAT_RKN_ACK(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GDBGSTAT_RKN_ACK_SHIFT)) & CPE_VFCCU_GDBGSTAT_RKN_ACK_MASK)

#define CPE_VFCCU_GDBGSTAT_RKN_REQ_MASK          (0x80000000U)
#define CPE_VFCCU_GDBGSTAT_RKN_REQ_SHIFT         (31U)
#define CPE_VFCCU_GDBGSTAT_RKN_REQ_WIDTH         (1U)
#define CPE_VFCCU_GDBGSTAT_RKN_REQ(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_GDBGSTAT_RKN_REQ_SHIFT)) & CPE_VFCCU_GDBGSTAT_RKN_REQ_MASK)
/*! @} */

/*! @name FHCFG0 - Fault Handler */
/*! @{ */

#define CPE_VFCCU_FHCFG0_FHIDEN_MASK             (0x1U)
#define CPE_VFCCU_FHCFG0_FHIDEN_SHIFT            (0U)
#define CPE_VFCCU_FHCFG0_FHIDEN_WIDTH            (1U)
#define CPE_VFCCU_FHCFG0_FHIDEN(x)               (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHCFG0_FHIDEN_SHIFT)) & CPE_VFCCU_FHCFG0_FHIDEN_MASK)
/*! @} */

/*! @name FHSRVDS0 - Fault Handler Status */
/*! @{ */

#define CPE_VFCCU_FHSRVDS0_SERV_DID_MASK         (0xFU)
#define CPE_VFCCU_FHSRVDS0_SERV_DID_SHIFT        (0U)
#define CPE_VFCCU_FHSRVDS0_SERV_DID_WIDTH        (4U)
#define CPE_VFCCU_FHSRVDS0_SERV_DID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHSRVDS0_SERV_DID_SHIFT)) & CPE_VFCCU_FHSRVDS0_SERV_DID_MASK)

