zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHSRVDS0_AGGFLTS_MASK          (0x100U)
#define CPE_VFCCU_FHSRVDS0_AGGFLTS_SHIFT         (8U)
#define CPE_VFCCU_FHSRVDS0_AGGFLTS_WIDTH         (1U)
#define CPE_VFCCU_FHSRVDS0_AGGFLTS(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHSRVDS0_AGGFLTS_SHIFT)) & CPE_VFCCU_FHSRVDS0_AGGFLTS_MASK)
/*! @} */

/*! @name FHFLTENC0_0 - Fault Enable */
/*! @{ */

#define CPE_VFCCU_FHFLTENC0_0_EN0_MASK           (0x1U)
#define CPE_VFCCU_FHFLTENC0_0_EN0_SHIFT          (0U)
#define CPE_VFCCU_FHFLTENC0_0_EN0_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN0(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN0_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN0_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN1_MASK           (0x2U)
#define CPE_VFCCU_FHFLTENC0_0_EN1_SHIFT          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN1_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN1(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN1_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN1_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN2_MASK           (0x4U)
#define CPE_VFCCU_FHFLTENC0_0_EN2_SHIFT          (2U)
#define CPE_VFCCU_FHFLTENC0_0_EN2_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN2(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN2_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN2_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN3_MASK           (0x8U)
#define CPE_VFCCU_FHFLTENC0_0_EN3_SHIFT          (3U)
#define CPE_VFCCU_FHFLTENC0_0_EN3_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN3(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN3_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN3_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN4_MASK           (0x10U)
#define CPE_VFCCU_FHFLTENC0_0_EN4_SHIFT          (4U)
#define CPE_VFCCU_FHFLTENC0_0_EN4_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN4(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN4_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN4_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN5_MASK           (0x20U)
#define CPE_VFCCU_FHFLTENC0_0_EN5_SHIFT          (5U)
#define CPE_VFCCU_FHFLTENC0_0_EN5_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN5(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN5_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN5_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN6_MASK           (0x40U)
#define CPE_VFCCU_FHFLTENC0_0_EN6_SHIFT          (6U)
#define CPE_VFCCU_FHFLTENC0_0_EN6_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN6(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN6_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN6_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN7_MASK           (0x80U)
#define CPE_VFCCU_FHFLTENC0_0_EN7_SHIFT          (7U)
#define CPE_VFCCU_FHFLTENC0_0_EN7_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN7(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN7_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN7_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN8_MASK           (0x100U)
#define CPE_VFCCU_FHFLTENC0_0_EN8_SHIFT          (8U)
#define CPE_VFCCU_FHFLTENC0_0_EN8_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN8(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN8_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN8_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN9_MASK           (0x200U)
#define CPE_VFCCU_FHFLTENC0_0_EN9_SHIFT          (9U)
#define CPE_VFCCU_FHFLTENC0_0_EN9_WIDTH          (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN9(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN9_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN9_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN10_MASK          (0x400U)
#define CPE_VFCCU_FHFLTENC0_0_EN10_SHIFT         (10U)
#define CPE_VFCCU_FHFLTENC0_0_EN10_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN10(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN10_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN10_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN11_MASK          (0x800U)
#define CPE_VFCCU_FHFLTENC0_0_EN11_SHIFT         (11U)
#define CPE_VFCCU_FHFLTENC0_0_EN11_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN11(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN11_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN11_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN12_MASK          (0x1000U)
#define CPE_VFCCU_FHFLTENC0_0_EN12_SHIFT         (12U)
#define CPE_VFCCU_FHFLTENC0_0_EN12_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN12(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN12_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN12_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN13_MASK          (0x2000U)
#define CPE_VFCCU_FHFLTENC0_0_EN13_SHIFT         (13U)
#define CPE_VFCCU_FHFLTENC0_0_EN13_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN13(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN13_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN13_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN14_MASK          (0x4000U)
#define CPE_VFCCU_FHFLTENC0_0_EN14_SHIFT         (14U)
#define CPE_VFCCU_FHFLTENC0_0_EN14_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN14(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN14_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN14_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN15_MASK          (0x8000U)
#define CPE_VFCCU_FHFLTENC0_0_EN15_SHIFT         (15U)
#define CPE_VFCCU_FHFLTENC0_0_EN15_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN15(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN15_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN15_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN16_MASK          (0x10000U)
#define CPE_VFCCU_FHFLTENC0_0_EN16_SHIFT         (16U)
#define CPE_VFCCU_FHFLTENC0_0_EN16_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN16(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN16_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN16_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN17_MASK          (0x20000U)
#define CPE_VFCCU_FHFLTENC0_0_EN17_SHIFT         (17U)
#define CPE_VFCCU_FHFLTENC0_0_EN17_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN17(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN17_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN17_MASK)

