zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTENC0_0_EN18_MASK          (0x40000U)
#define CPE_VFCCU_FHFLTENC0_0_EN18_SHIFT         (18U)
#define CPE_VFCCU_FHFLTENC0_0_EN18_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN18(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN18_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN18_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN19_MASK          (0x80000U)
#define CPE_VFCCU_FHFLTENC0_0_EN19_SHIFT         (19U)
#define CPE_VFCCU_FHFLTENC0_0_EN19_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN19(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN19_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN19_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN20_MASK          (0x100000U)
#define CPE_VFCCU_FHFLTENC0_0_EN20_SHIFT         (20U)
#define CPE_VFCCU_FHFLTENC0_0_EN20_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN20(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN20_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN20_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN21_MASK          (0x200000U)
#define CPE_VFCCU_FHFLTENC0_0_EN21_SHIFT         (21U)
#define CPE_VFCCU_FHFLTENC0_0_EN21_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN21(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN21_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN21_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN22_MASK          (0x400000U)
#define CPE_VFCCU_FHFLTENC0_0_EN22_SHIFT         (22U)
#define CPE_VFCCU_FHFLTENC0_0_EN22_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN22(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN22_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN22_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN23_MASK          (0x800000U)
#define CPE_VFCCU_FHFLTENC0_0_EN23_SHIFT         (23U)
#define CPE_VFCCU_FHFLTENC0_0_EN23_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN23(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN23_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN23_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN24_MASK          (0x1000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN24_SHIFT         (24U)
#define CPE_VFCCU_FHFLTENC0_0_EN24_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN24(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN24_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN24_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN25_MASK          (0x2000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN25_SHIFT         (25U)
#define CPE_VFCCU_FHFLTENC0_0_EN25_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN25(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN25_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN25_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN26_MASK          (0x4000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN26_SHIFT         (26U)
#define CPE_VFCCU_FHFLTENC0_0_EN26_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN26(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN26_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN26_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN27_MASK          (0x8000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN27_SHIFT         (27U)
#define CPE_VFCCU_FHFLTENC0_0_EN27_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN27(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN27_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN27_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN28_MASK          (0x10000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN28_SHIFT         (28U)
#define CPE_VFCCU_FHFLTENC0_0_EN28_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN28(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN28_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN28_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN29_MASK          (0x20000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN29_SHIFT         (29U)
#define CPE_VFCCU_FHFLTENC0_0_EN29_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN29(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN29_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN29_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN30_MASK          (0x40000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN30_SHIFT         (30U)
#define CPE_VFCCU_FHFLTENC0_0_EN30_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN30(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN30_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN30_MASK)

#define CPE_VFCCU_FHFLTENC0_0_EN31_MASK          (0x80000000U)
#define CPE_VFCCU_FHFLTENC0_0_EN31_SHIFT         (31U)
#define CPE_VFCCU_FHFLTENC0_0_EN31_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_0_EN31(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_0_EN31_SHIFT)) & CPE_VFCCU_FHFLTENC0_0_EN31_MASK)
/*! @} */

/*! @name FHFLTENC0_1 - Fault Enable */
/*! @{ */

#define CPE_VFCCU_FHFLTENC0_1_EN32_MASK          (0x1U)
#define CPE_VFCCU_FHFLTENC0_1_EN32_SHIFT         (0U)
#define CPE_VFCCU_FHFLTENC0_1_EN32_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN32(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN32_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN32_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN33_MASK          (0x2U)
#define CPE_VFCCU_FHFLTENC0_1_EN33_SHIFT         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN33_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN33(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN33_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN33_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN34_MASK          (0x4U)
#define CPE_VFCCU_FHFLTENC0_1_EN34_SHIFT         (2U)
#define CPE_VFCCU_FHFLTENC0_1_EN34_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN34(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN34_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN34_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN35_MASK          (0x8U)
#define CPE_VFCCU_FHFLTENC0_1_EN35_SHIFT         (3U)
#define CPE_VFCCU_FHFLTENC0_1_EN35_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN35(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN35_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN35_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN36_MASK          (0x10U)
#define CPE_VFCCU_FHFLTENC0_1_EN36_SHIFT         (4U)
#define CPE_VFCCU_FHFLTENC0_1_EN36_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN36(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN36_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN36_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN37_MASK          (0x20U)
#define CPE_VFCCU_FHFLTENC0_1_EN37_SHIFT         (5U)
#define CPE_VFCCU_FHFLTENC0_1_EN37_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN37(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN37_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN37_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN38_MASK          (0x40U)
#define CPE_VFCCU_FHFLTENC0_1_EN38_SHIFT         (6U)
#define CPE_VFCCU_FHFLTENC0_1_EN38_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN38(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN38_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN38_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN39_MASK          (0x80U)
#define CPE_VFCCU_FHFLTENC0_1_EN39_SHIFT         (7U)
#define CPE_VFCCU_FHFLTENC0_1_EN39_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN39(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN39_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN39_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN40_MASK          (0x100U)
#define CPE_VFCCU_FHFLTENC0_1_EN40_SHIFT         (8U)
#define CPE_VFCCU_FHFLTENC0_1_EN40_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN40(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN40_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN40_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN41_MASK          (0x200U)
#define CPE_VFCCU_FHFLTENC0_1_EN41_SHIFT         (9U)
#define CPE_VFCCU_FHFLTENC0_1_EN41_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN41(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN41_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN41_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN42_MASK          (0x400U)
#define CPE_VFCCU_FHFLTENC0_1_EN42_SHIFT         (10U)
#define CPE_VFCCU_FHFLTENC0_1_EN42_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN42(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN42_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN42_MASK)

