zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTENC0_1_EN62_MASK          (0x40000000U)
#define CPE_VFCCU_FHFLTENC0_1_EN62_SHIFT         (30U)
#define CPE_VFCCU_FHFLTENC0_1_EN62_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN62(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN62_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN62_MASK)

#define CPE_VFCCU_FHFLTENC0_1_EN63_MASK          (0x80000000U)
#define CPE_VFCCU_FHFLTENC0_1_EN63_SHIFT         (31U)
#define CPE_VFCCU_FHFLTENC0_1_EN63_WIDTH         (1U)
#define CPE_VFCCU_FHFLTENC0_1_EN63(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTENC0_1_EN63_SHIFT)) & CPE_VFCCU_FHFLTENC0_1_EN63_MASK)
/*! @} */

/*! @name FHFLTS0_0 - Fault Status */
/*! @{ */

#define CPE_VFCCU_FHFLTS0_0_STAT0_MASK           (0x1U)
#define CPE_VFCCU_FHFLTS0_0_STAT0_SHIFT          (0U)
#define CPE_VFCCU_FHFLTS0_0_STAT0_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT0(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT0_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT0_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT1_MASK           (0x2U)
#define CPE_VFCCU_FHFLTS0_0_STAT1_SHIFT          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT1_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT1(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT1_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT1_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT2_MASK           (0x4U)
#define CPE_VFCCU_FHFLTS0_0_STAT2_SHIFT          (2U)
#define CPE_VFCCU_FHFLTS0_0_STAT2_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT2(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT2_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT2_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT3_MASK           (0x8U)
#define CPE_VFCCU_FHFLTS0_0_STAT3_SHIFT          (3U)
#define CPE_VFCCU_FHFLTS0_0_STAT3_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT3(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT3_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT3_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT4_MASK           (0x10U)
#define CPE_VFCCU_FHFLTS0_0_STAT4_SHIFT          (4U)
#define CPE_VFCCU_FHFLTS0_0_STAT4_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT4(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT4_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT4_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT5_MASK           (0x20U)
#define CPE_VFCCU_FHFLTS0_0_STAT5_SHIFT          (5U)
#define CPE_VFCCU_FHFLTS0_0_STAT5_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT5(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT5_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT5_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT6_MASK           (0x40U)
#define CPE_VFCCU_FHFLTS0_0_STAT6_SHIFT          (6U)
#define CPE_VFCCU_FHFLTS0_0_STAT6_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT6(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT6_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT6_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT7_MASK           (0x80U)
#define CPE_VFCCU_FHFLTS0_0_STAT7_SHIFT          (7U)
#define CPE_VFCCU_FHFLTS0_0_STAT7_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT7(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT7_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT7_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT8_MASK           (0x100U)
#define CPE_VFCCU_FHFLTS0_0_STAT8_SHIFT          (8U)
#define CPE_VFCCU_FHFLTS0_0_STAT8_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT8(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT8_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT8_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT9_MASK           (0x200U)
#define CPE_VFCCU_FHFLTS0_0_STAT9_SHIFT          (9U)
#define CPE_VFCCU_FHFLTS0_0_STAT9_WIDTH          (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT9(x)             (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT9_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT9_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT10_MASK          (0x400U)
#define CPE_VFCCU_FHFLTS0_0_STAT10_SHIFT         (10U)
#define CPE_VFCCU_FHFLTS0_0_STAT10_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT10(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT10_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT10_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT11_MASK          (0x800U)
#define CPE_VFCCU_FHFLTS0_0_STAT11_SHIFT         (11U)
#define CPE_VFCCU_FHFLTS0_0_STAT11_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT11(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT11_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT11_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT12_MASK          (0x1000U)
#define CPE_VFCCU_FHFLTS0_0_STAT12_SHIFT         (12U)
#define CPE_VFCCU_FHFLTS0_0_STAT12_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT12(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT12_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT12_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT13_MASK          (0x2000U)
#define CPE_VFCCU_FHFLTS0_0_STAT13_SHIFT         (13U)
#define CPE_VFCCU_FHFLTS0_0_STAT13_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT13(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT13_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT13_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT14_MASK          (0x4000U)
#define CPE_VFCCU_FHFLTS0_0_STAT14_SHIFT         (14U)
#define CPE_VFCCU_FHFLTS0_0_STAT14_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT14(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT14_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT14_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT15_MASK          (0x8000U)
#define CPE_VFCCU_FHFLTS0_0_STAT15_SHIFT         (15U)
#define CPE_VFCCU_FHFLTS0_0_STAT15_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT15(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT15_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT15_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT16_MASK          (0x10000U)
#define CPE_VFCCU_FHFLTS0_0_STAT16_SHIFT         (16U)
#define CPE_VFCCU_FHFLTS0_0_STAT16_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT16(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT16_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT16_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT17_MASK          (0x20000U)
#define CPE_VFCCU_FHFLTS0_0_STAT17_SHIFT         (17U)
#define CPE_VFCCU_FHFLTS0_0_STAT17_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT17(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT17_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT17_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT18_MASK          (0x40000U)
#define CPE_VFCCU_FHFLTS0_0_STAT18_SHIFT         (18U)
#define CPE_VFCCU_FHFLTS0_0_STAT18_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT18(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT18_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT18_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT19_MASK          (0x80000U)
#define CPE_VFCCU_FHFLTS0_0_STAT19_SHIFT         (19U)
#define CPE_VFCCU_FHFLTS0_0_STAT19_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT19(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT19_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT19_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT20_MASK          (0x100000U)
#define CPE_VFCCU_FHFLTS0_0_STAT20_SHIFT         (20U)
#define CPE_VFCCU_FHFLTS0_0_STAT20_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT20(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT20_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT20_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT21_MASK          (0x200000U)
#define CPE_VFCCU_FHFLTS0_0_STAT21_SHIFT         (21U)
#define CPE_VFCCU_FHFLTS0_0_STAT21_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT21(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT21_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT21_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT22_MASK          (0x400000U)
#define CPE_VFCCU_FHFLTS0_0_STAT22_SHIFT         (22U)
#define CPE_VFCCU_FHFLTS0_0_STAT22_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT22(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT22_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT22_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT23_MASK          (0x800000U)
#define CPE_VFCCU_FHFLTS0_0_STAT23_SHIFT         (23U)
#define CPE_VFCCU_FHFLTS0_0_STAT23_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT23(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT23_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT23_MASK)

