zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTS0_0_STAT24_MASK          (0x1000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT24_SHIFT         (24U)
#define CPE_VFCCU_FHFLTS0_0_STAT24_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT24(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT24_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT24_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT25_MASK          (0x2000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT25_SHIFT         (25U)
#define CPE_VFCCU_FHFLTS0_0_STAT25_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT25(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT25_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT25_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT26_MASK          (0x4000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT26_SHIFT         (26U)
#define CPE_VFCCU_FHFLTS0_0_STAT26_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT26(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT26_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT26_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT27_MASK          (0x8000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT27_SHIFT         (27U)
#define CPE_VFCCU_FHFLTS0_0_STAT27_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT27(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT27_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT27_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT28_MASK          (0x10000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT28_SHIFT         (28U)
#define CPE_VFCCU_FHFLTS0_0_STAT28_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT28(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT28_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT28_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT29_MASK          (0x20000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT29_SHIFT         (29U)
#define CPE_VFCCU_FHFLTS0_0_STAT29_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT29(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT29_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT29_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT30_MASK          (0x40000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT30_SHIFT         (30U)
#define CPE_VFCCU_FHFLTS0_0_STAT30_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT30(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT30_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT30_MASK)

#define CPE_VFCCU_FHFLTS0_0_STAT31_MASK          (0x80000000U)
#define CPE_VFCCU_FHFLTS0_0_STAT31_SHIFT         (31U)
#define CPE_VFCCU_FHFLTS0_0_STAT31_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_0_STAT31(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_0_STAT31_SHIFT)) & CPE_VFCCU_FHFLTS0_0_STAT31_MASK)
/*! @} */

/*! @name FHFLTS0_1 - Fault Status */
/*! @{ */

#define CPE_VFCCU_FHFLTS0_1_STAT32_MASK          (0x1U)
#define CPE_VFCCU_FHFLTS0_1_STAT32_SHIFT         (0U)
#define CPE_VFCCU_FHFLTS0_1_STAT32_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT32(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT32_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT32_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT33_MASK          (0x2U)
#define CPE_VFCCU_FHFLTS0_1_STAT33_SHIFT         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT33_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT33(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT33_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT33_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT34_MASK          (0x4U)
#define CPE_VFCCU_FHFLTS0_1_STAT34_SHIFT         (2U)
#define CPE_VFCCU_FHFLTS0_1_STAT34_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT34(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT34_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT34_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT35_MASK          (0x8U)
#define CPE_VFCCU_FHFLTS0_1_STAT35_SHIFT         (3U)
#define CPE_VFCCU_FHFLTS0_1_STAT35_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT35(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT35_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT35_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT36_MASK          (0x10U)
#define CPE_VFCCU_FHFLTS0_1_STAT36_SHIFT         (4U)
#define CPE_VFCCU_FHFLTS0_1_STAT36_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT36(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT36_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT36_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT37_MASK          (0x20U)
#define CPE_VFCCU_FHFLTS0_1_STAT37_SHIFT         (5U)
#define CPE_VFCCU_FHFLTS0_1_STAT37_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT37(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT37_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT37_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT38_MASK          (0x40U)
#define CPE_VFCCU_FHFLTS0_1_STAT38_SHIFT         (6U)
#define CPE_VFCCU_FHFLTS0_1_STAT38_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT38(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT38_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT38_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT39_MASK          (0x80U)
#define CPE_VFCCU_FHFLTS0_1_STAT39_SHIFT         (7U)
#define CPE_VFCCU_FHFLTS0_1_STAT39_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT39(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT39_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT39_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT40_MASK          (0x100U)
#define CPE_VFCCU_FHFLTS0_1_STAT40_SHIFT         (8U)
#define CPE_VFCCU_FHFLTS0_1_STAT40_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT40(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT40_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT40_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT41_MASK          (0x200U)
#define CPE_VFCCU_FHFLTS0_1_STAT41_SHIFT         (9U)
#define CPE_VFCCU_FHFLTS0_1_STAT41_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT41(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT41_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT41_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT42_MASK          (0x400U)
#define CPE_VFCCU_FHFLTS0_1_STAT42_SHIFT         (10U)
#define CPE_VFCCU_FHFLTS0_1_STAT42_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT42(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT42_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT42_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT43_MASK          (0x800U)
#define CPE_VFCCU_FHFLTS0_1_STAT43_SHIFT         (11U)
#define CPE_VFCCU_FHFLTS0_1_STAT43_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT43(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT43_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT43_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT44_MASK          (0x1000U)
#define CPE_VFCCU_FHFLTS0_1_STAT44_SHIFT         (12U)
#define CPE_VFCCU_FHFLTS0_1_STAT44_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT44(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT44_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT44_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT45_MASK          (0x2000U)
#define CPE_VFCCU_FHFLTS0_1_STAT45_SHIFT         (13U)
#define CPE_VFCCU_FHFLTS0_1_STAT45_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT45(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT45_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT45_MASK)

