zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTS0_1_STAT46_MASK          (0x4000U)
#define CPE_VFCCU_FHFLTS0_1_STAT46_SHIFT         (14U)
#define CPE_VFCCU_FHFLTS0_1_STAT46_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT46(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT46_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT46_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT47_MASK          (0x8000U)
#define CPE_VFCCU_FHFLTS0_1_STAT47_SHIFT         (15U)
#define CPE_VFCCU_FHFLTS0_1_STAT47_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT47(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT47_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT47_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT48_MASK          (0x10000U)
#define CPE_VFCCU_FHFLTS0_1_STAT48_SHIFT         (16U)
#define CPE_VFCCU_FHFLTS0_1_STAT48_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT48(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT48_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT48_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT49_MASK          (0x20000U)
#define CPE_VFCCU_FHFLTS0_1_STAT49_SHIFT         (17U)
#define CPE_VFCCU_FHFLTS0_1_STAT49_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT49(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT49_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT49_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT50_MASK          (0x40000U)
#define CPE_VFCCU_FHFLTS0_1_STAT50_SHIFT         (18U)
#define CPE_VFCCU_FHFLTS0_1_STAT50_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT50(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT50_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT50_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT51_MASK          (0x80000U)
#define CPE_VFCCU_FHFLTS0_1_STAT51_SHIFT         (19U)
#define CPE_VFCCU_FHFLTS0_1_STAT51_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT51(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT51_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT51_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT52_MASK          (0x100000U)
#define CPE_VFCCU_FHFLTS0_1_STAT52_SHIFT         (20U)
#define CPE_VFCCU_FHFLTS0_1_STAT52_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT52(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT52_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT52_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT53_MASK          (0x200000U)
#define CPE_VFCCU_FHFLTS0_1_STAT53_SHIFT         (21U)
#define CPE_VFCCU_FHFLTS0_1_STAT53_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT53(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT53_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT53_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT54_MASK          (0x400000U)
#define CPE_VFCCU_FHFLTS0_1_STAT54_SHIFT         (22U)
#define CPE_VFCCU_FHFLTS0_1_STAT54_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT54(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT54_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT54_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT55_MASK          (0x800000U)
#define CPE_VFCCU_FHFLTS0_1_STAT55_SHIFT         (23U)
#define CPE_VFCCU_FHFLTS0_1_STAT55_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT55(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT55_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT55_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT56_MASK          (0x1000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT56_SHIFT         (24U)
#define CPE_VFCCU_FHFLTS0_1_STAT56_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT56(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT56_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT56_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT57_MASK          (0x2000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT57_SHIFT         (25U)
#define CPE_VFCCU_FHFLTS0_1_STAT57_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT57(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT57_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT57_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT58_MASK          (0x4000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT58_SHIFT         (26U)
#define CPE_VFCCU_FHFLTS0_1_STAT58_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT58(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT58_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT58_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT59_MASK          (0x8000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT59_SHIFT         (27U)
#define CPE_VFCCU_FHFLTS0_1_STAT59_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT59(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT59_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT59_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT60_MASK          (0x10000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT60_SHIFT         (28U)
#define CPE_VFCCU_FHFLTS0_1_STAT60_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT60(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT60_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT60_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT61_MASK          (0x20000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT61_SHIFT         (29U)
#define CPE_VFCCU_FHFLTS0_1_STAT61_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT61(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT61_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT61_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT62_MASK          (0x40000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT62_SHIFT         (30U)
#define CPE_VFCCU_FHFLTS0_1_STAT62_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT62(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT62_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT62_MASK)

#define CPE_VFCCU_FHFLTS0_1_STAT63_MASK          (0x80000000U)
#define CPE_VFCCU_FHFLTS0_1_STAT63_SHIFT         (31U)
#define CPE_VFCCU_FHFLTS0_1_STAT63_WIDTH         (1U)
#define CPE_VFCCU_FHFLTS0_1_STAT63(x)            (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTS0_1_STAT63_SHIFT)) & CPE_VFCCU_FHFLTS0_1_STAT63_MASK)
/*! @} */

/*! @name FHFLTRKC0_0 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL0_MASK       (0x7U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL0_SHIFT      (0U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL0_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL0(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_0_RKNSEL0_SHIFT)) & CPE_VFCCU_FHFLTRKC0_0_RKNSEL0_MASK)

#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL1_MASK       (0x700U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL1_SHIFT      (8U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL1_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL1(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_0_RKNSEL1_SHIFT)) & CPE_VFCCU_FHFLTRKC0_0_RKNSEL1_MASK)

#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL2_MASK       (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL2_SHIFT      (16U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL2_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL2(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_0_RKNSEL2_SHIFT)) & CPE_VFCCU_FHFLTRKC0_0_RKNSEL2_MASK)

#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL3_MASK       (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL3_SHIFT      (24U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL3_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_0_RKNSEL3(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_0_RKNSEL3_SHIFT)) & CPE_VFCCU_FHFLTRKC0_0_RKNSEL3_MASK)
/*! @} */

/*! @name FHFLTRKC0_1 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL4_MASK       (0x7U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL4_SHIFT      (0U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL4_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL4(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_1_RKNSEL4_SHIFT)) & CPE_VFCCU_FHFLTRKC0_1_RKNSEL4_MASK)

#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL5_MASK       (0x700U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL5_SHIFT      (8U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL5_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL5(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_1_RKNSEL5_SHIFT)) & CPE_VFCCU_FHFLTRKC0_1_RKNSEL5_MASK)

#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL6_MASK       (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL6_SHIFT      (16U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL6_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL6(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_1_RKNSEL6_SHIFT)) & CPE_VFCCU_FHFLTRKC0_1_RKNSEL6_MASK)

#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL7_MASK       (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL7_SHIFT      (24U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL7_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_1_RKNSEL7(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_1_RKNSEL7_SHIFT)) & CPE_VFCCU_FHFLTRKC0_1_RKNSEL7_MASK)
/*! @} */

/*! @name FHFLTRKC0_2 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL8_MASK       (0x7U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL8_SHIFT      (0U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL8_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL8(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_2_RKNSEL8_SHIFT)) & CPE_VFCCU_FHFLTRKC0_2_RKNSEL8_MASK)

#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL9_MASK       (0x700U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL9_SHIFT      (8U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL9_WIDTH      (3U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL9(x)         (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_2_RKNSEL9_SHIFT)) & CPE_VFCCU_FHFLTRKC0_2_RKNSEL9_MASK)

#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL10_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL10_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL10_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL10(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_2_RKNSEL10_SHIFT)) & CPE_VFCCU_FHFLTRKC0_2_RKNSEL10_MASK)

