zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL11_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL11_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL11_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_2_RKNSEL11(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_2_RKNSEL11_SHIFT)) & CPE_VFCCU_FHFLTRKC0_2_RKNSEL11_MASK)
/*! @} */

/*! @name FHFLTRKC0_3 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL12_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL12_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL12_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL12(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_3_RKNSEL12_SHIFT)) & CPE_VFCCU_FHFLTRKC0_3_RKNSEL12_MASK)

#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL13_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL13_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL13_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL13(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_3_RKNSEL13_SHIFT)) & CPE_VFCCU_FHFLTRKC0_3_RKNSEL13_MASK)

#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL14_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL14_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL14_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL14(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_3_RKNSEL14_SHIFT)) & CPE_VFCCU_FHFLTRKC0_3_RKNSEL14_MASK)

#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL15_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL15_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL15_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_3_RKNSEL15(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_3_RKNSEL15_SHIFT)) & CPE_VFCCU_FHFLTRKC0_3_RKNSEL15_MASK)
/*! @} */

/*! @name FHFLTRKC0_4 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL16_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL16_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL16_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL16(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_4_RKNSEL16_SHIFT)) & CPE_VFCCU_FHFLTRKC0_4_RKNSEL16_MASK)

#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL17_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL17_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL17_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL17(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_4_RKNSEL17_SHIFT)) & CPE_VFCCU_FHFLTRKC0_4_RKNSEL17_MASK)

#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL18_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL18_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL18_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL18(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_4_RKNSEL18_SHIFT)) & CPE_VFCCU_FHFLTRKC0_4_RKNSEL18_MASK)

#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL19_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL19_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL19_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_4_RKNSEL19(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_4_RKNSEL19_SHIFT)) & CPE_VFCCU_FHFLTRKC0_4_RKNSEL19_MASK)
/*! @} */

/*! @name FHFLTRKC0_5 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL20_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL20_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL20_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL20(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_5_RKNSEL20_SHIFT)) & CPE_VFCCU_FHFLTRKC0_5_RKNSEL20_MASK)

#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL21_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL21_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL21_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL21(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_5_RKNSEL21_SHIFT)) & CPE_VFCCU_FHFLTRKC0_5_RKNSEL21_MASK)

#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL22_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL22_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL22_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL22(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_5_RKNSEL22_SHIFT)) & CPE_VFCCU_FHFLTRKC0_5_RKNSEL22_MASK)

#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL23_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL23_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL23_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_5_RKNSEL23(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_5_RKNSEL23_SHIFT)) & CPE_VFCCU_FHFLTRKC0_5_RKNSEL23_MASK)
/*! @} */

/*! @name FHFLTRKC0_6 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL24_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL24_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL24_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL24(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_6_RKNSEL24_SHIFT)) & CPE_VFCCU_FHFLTRKC0_6_RKNSEL24_MASK)

#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL25_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL25_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL25_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL25(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_6_RKNSEL25_SHIFT)) & CPE_VFCCU_FHFLTRKC0_6_RKNSEL25_MASK)

#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL26_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL26_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL26_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL26(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_6_RKNSEL26_SHIFT)) & CPE_VFCCU_FHFLTRKC0_6_RKNSEL26_MASK)

#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL27_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL27_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL27_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_6_RKNSEL27(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_6_RKNSEL27_SHIFT)) & CPE_VFCCU_FHFLTRKC0_6_RKNSEL27_MASK)
/*! @} */

/*! @name FHFLTRKC0_7 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL28_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL28_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL28_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL28(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_7_RKNSEL28_SHIFT)) & CPE_VFCCU_FHFLTRKC0_7_RKNSEL28_MASK)

