zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL29_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL29_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL29_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL29(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_7_RKNSEL29_SHIFT)) & CPE_VFCCU_FHFLTRKC0_7_RKNSEL29_MASK)

#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL30_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL30_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL30_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL30(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_7_RKNSEL30_SHIFT)) & CPE_VFCCU_FHFLTRKC0_7_RKNSEL30_MASK)

#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL31_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL31_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL31_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_7_RKNSEL31(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_7_RKNSEL31_SHIFT)) & CPE_VFCCU_FHFLTRKC0_7_RKNSEL31_MASK)
/*! @} */

/*! @name FHFLTRKC0_8 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL32_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL32_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL32_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL32(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_8_RKNSEL32_SHIFT)) & CPE_VFCCU_FHFLTRKC0_8_RKNSEL32_MASK)

#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL33_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL33_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL33_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL33(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_8_RKNSEL33_SHIFT)) & CPE_VFCCU_FHFLTRKC0_8_RKNSEL33_MASK)

#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL34_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL34_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL34_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL34(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_8_RKNSEL34_SHIFT)) & CPE_VFCCU_FHFLTRKC0_8_RKNSEL34_MASK)

#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL35_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL35_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL35_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_8_RKNSEL35(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_8_RKNSEL35_SHIFT)) & CPE_VFCCU_FHFLTRKC0_8_RKNSEL35_MASK)
/*! @} */

/*! @name FHFLTRKC0_9 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL36_MASK      (0x7U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL36_SHIFT     (0U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL36_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL36(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_9_RKNSEL36_SHIFT)) & CPE_VFCCU_FHFLTRKC0_9_RKNSEL36_MASK)

#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL37_MASK      (0x700U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL37_SHIFT     (8U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL37_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL37(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_9_RKNSEL37_SHIFT)) & CPE_VFCCU_FHFLTRKC0_9_RKNSEL37_MASK)

#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL38_MASK      (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL38_SHIFT     (16U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL38_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL38(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_9_RKNSEL38_SHIFT)) & CPE_VFCCU_FHFLTRKC0_9_RKNSEL38_MASK)

#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL39_MASK      (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL39_SHIFT     (24U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL39_WIDTH     (3U)
#define CPE_VFCCU_FHFLTRKC0_9_RKNSEL39(x)        (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_9_RKNSEL39_SHIFT)) & CPE_VFCCU_FHFLTRKC0_9_RKNSEL39_MASK)
/*! @} */

/*! @name FHFLTRKC0_10 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL40_MASK     (0x7U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL40_SHIFT    (0U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL40_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL40(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_10_RKNSEL40_SHIFT)) & CPE_VFCCU_FHFLTRKC0_10_RKNSEL40_MASK)

#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL41_MASK     (0x700U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL41_SHIFT    (8U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL41_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL41(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_10_RKNSEL41_SHIFT)) & CPE_VFCCU_FHFLTRKC0_10_RKNSEL41_MASK)

#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL42_MASK     (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL42_SHIFT    (16U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL42_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL42(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_10_RKNSEL42_SHIFT)) & CPE_VFCCU_FHFLTRKC0_10_RKNSEL42_MASK)

#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL43_MASK     (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL43_SHIFT    (24U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL43_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_10_RKNSEL43(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_10_RKNSEL43_SHIFT)) & CPE_VFCCU_FHFLTRKC0_10_RKNSEL43_MASK)
/*! @} */

/*! @name FHFLTRKC0_11 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL44_MASK     (0x7U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL44_SHIFT    (0U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL44_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL44(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_11_RKNSEL44_SHIFT)) & CPE_VFCCU_FHFLTRKC0_11_RKNSEL44_MASK)

#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL45_MASK     (0x700U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL45_SHIFT    (8U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL45_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL45(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_11_RKNSEL45_SHIFT)) & CPE_VFCCU_FHFLTRKC0_11_RKNSEL45_MASK)

#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL46_MASK     (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL46_SHIFT    (16U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL46_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL46(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_11_RKNSEL46_SHIFT)) & CPE_VFCCU_FHFLTRKC0_11_RKNSEL46_MASK)

