zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL47_MASK     (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL47_SHIFT    (24U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL47_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_11_RKNSEL47(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_11_RKNSEL47_SHIFT)) & CPE_VFCCU_FHFLTRKC0_11_RKNSEL47_MASK)
/*! @} */

/*! @name FHFLTRKC0_12 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL48_MASK     (0x7U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL48_SHIFT    (0U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL48_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL48(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_12_RKNSEL48_SHIFT)) & CPE_VFCCU_FHFLTRKC0_12_RKNSEL48_MASK)

#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL49_MASK     (0x700U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL49_SHIFT    (8U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL49_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL49(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_12_RKNSEL49_SHIFT)) & CPE_VFCCU_FHFLTRKC0_12_RKNSEL49_MASK)

#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL50_MASK     (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL50_SHIFT    (16U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL50_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL50(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_12_RKNSEL50_SHIFT)) & CPE_VFCCU_FHFLTRKC0_12_RKNSEL50_MASK)

#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL51_MASK     (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL51_SHIFT    (24U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL51_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_12_RKNSEL51(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_12_RKNSEL51_SHIFT)) & CPE_VFCCU_FHFLTRKC0_12_RKNSEL51_MASK)
/*! @} */

/*! @name FHFLTRKC0_13 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL52_MASK     (0x7U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL52_SHIFT    (0U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL52_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL52(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_13_RKNSEL52_SHIFT)) & CPE_VFCCU_FHFLTRKC0_13_RKNSEL52_MASK)

#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL53_MASK     (0x700U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL53_SHIFT    (8U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL53_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL53(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_13_RKNSEL53_SHIFT)) & CPE_VFCCU_FHFLTRKC0_13_RKNSEL53_MASK)

#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL54_MASK     (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL54_SHIFT    (16U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL54_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL54(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_13_RKNSEL54_SHIFT)) & CPE_VFCCU_FHFLTRKC0_13_RKNSEL54_MASK)

#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL55_MASK     (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL55_SHIFT    (24U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL55_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_13_RKNSEL55(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_13_RKNSEL55_SHIFT)) & CPE_VFCCU_FHFLTRKC0_13_RKNSEL55_MASK)
/*! @} */

/*! @name FHFLTRKC0_14 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL56_MASK     (0x7U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL56_SHIFT    (0U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL56_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL56(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_14_RKNSEL56_SHIFT)) & CPE_VFCCU_FHFLTRKC0_14_RKNSEL56_MASK)

#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL57_MASK     (0x700U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL57_SHIFT    (8U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL57_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL57(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_14_RKNSEL57_SHIFT)) & CPE_VFCCU_FHFLTRKC0_14_RKNSEL57_MASK)

#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL58_MASK     (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL58_SHIFT    (16U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL58_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL58(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_14_RKNSEL58_SHIFT)) & CPE_VFCCU_FHFLTRKC0_14_RKNSEL58_MASK)

#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL59_MASK     (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL59_SHIFT    (24U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL59_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_14_RKNSEL59(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_14_RKNSEL59_SHIFT)) & CPE_VFCCU_FHFLTRKC0_14_RKNSEL59_MASK)
/*! @} */

/*! @name FHFLTRKC0_15 - Fault Reaction Set Configuration */
/*! @{ */

#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL60_MASK     (0x7U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL60_SHIFT    (0U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL60_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL60(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_15_RKNSEL60_SHIFT)) & CPE_VFCCU_FHFLTRKC0_15_RKNSEL60_MASK)

#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL61_MASK     (0x700U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL61_SHIFT    (8U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL61_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL61(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_15_RKNSEL61_SHIFT)) & CPE_VFCCU_FHFLTRKC0_15_RKNSEL61_MASK)

#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL62_MASK     (0x70000U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL62_SHIFT    (16U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL62_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL62(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_15_RKNSEL62_SHIFT)) & CPE_VFCCU_FHFLTRKC0_15_RKNSEL62_MASK)

#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL63_MASK     (0x7000000U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL63_SHIFT    (24U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL63_WIDTH    (3U)
#define CPE_VFCCU_FHFLTRKC0_15_RKNSEL63(x)       (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHFLTRKC0_15_RKNSEL63_SHIFT)) & CPE_VFCCU_FHFLTRKC0_15_RKNSEL63_MASK)
/*! @} */

/*! @name FHIMRKC0_00 - Immediate Reaction Configuration */
/*! @{ */

#define CPE_VFCCU_FHIMRKC0_00_RKNEN0_MASK        (0x1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN0_SHIFT       (0U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN0_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN0(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN0_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN0_MASK)

#define CPE_VFCCU_FHIMRKC0_00_RKNEN1_MASK        (0x2U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN1_SHIFT       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN1_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN1(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN1_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN1_MASK)

#define CPE_VFCCU_FHIMRKC0_00_RKNEN2_MASK        (0x4U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN2_SHIFT       (2U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN2_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN2(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN2_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN2_MASK)

#define CPE_VFCCU_FHIMRKC0_00_RKNEN3_MASK        (0x8U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN3_SHIFT       (3U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN3_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN3(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN3_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN3_MASK)

#define CPE_VFCCU_FHIMRKC0_00_RKNEN4_MASK        (0x10U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN4_SHIFT       (4U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN4_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN4(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN4_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN4_MASK)

#define CPE_VFCCU_FHIMRKC0_00_RKNEN5_MASK        (0x20U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN5_SHIFT       (5U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN5_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN5(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN5_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN5_MASK)

