zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
#define CPE_VFCCU_FHIMRKC0_00_RKNEN6_MASK        (0x40U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN6_SHIFT       (6U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN6_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN6(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN6_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN6_MASK)

#define CPE_VFCCU_FHIMRKC0_00_RKNEN7_MASK        (0x80U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN7_SHIFT       (7U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN7_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_00_RKNEN7(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_00_RKNEN7_SHIFT)) & CPE_VFCCU_FHIMRKC0_00_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_10 - Immediate Reaction Configuration */
/*! @{ */

#define CPE_VFCCU_FHIMRKC0_10_RKNEN0_MASK        (0x1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN0_SHIFT       (0U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN0_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN0(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN0_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN0_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN1_MASK        (0x2U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN1_SHIFT       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN1_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN1(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN1_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN1_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN2_MASK        (0x4U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN2_SHIFT       (2U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN2_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN2(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN2_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN2_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN3_MASK        (0x8U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN3_SHIFT       (3U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN3_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN3(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN3_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN3_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN4_MASK        (0x10U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN4_SHIFT       (4U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN4_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN4(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN4_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN4_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN5_MASK        (0x20U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN5_SHIFT       (5U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN5_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN5(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN5_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN5_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN6_MASK        (0x40U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN6_SHIFT       (6U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN6_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN6(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN6_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN6_MASK)

#define CPE_VFCCU_FHIMRKC0_10_RKNEN7_MASK        (0x80U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN7_SHIFT       (7U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN7_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_10_RKNEN7(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_10_RKNEN7_SHIFT)) & CPE_VFCCU_FHIMRKC0_10_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_20 - Immediate Reaction Configuration */
/*! @{ */

#define CPE_VFCCU_FHIMRKC0_20_RKNEN0_MASK        (0x1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN0_SHIFT       (0U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN0_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN0(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN0_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN0_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN1_MASK        (0x2U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN1_SHIFT       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN1_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN1(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN1_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN1_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN2_MASK        (0x4U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN2_SHIFT       (2U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN2_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN2(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN2_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN2_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN3_MASK        (0x8U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN3_SHIFT       (3U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN3_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN3(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN3_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN3_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN4_MASK        (0x10U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN4_SHIFT       (4U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN4_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN4(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN4_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN4_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN5_MASK        (0x20U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN5_SHIFT       (5U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN5_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN5(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN5_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN5_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN6_MASK        (0x40U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN6_SHIFT       (6U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN6_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN6(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN6_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN6_MASK)

#define CPE_VFCCU_FHIMRKC0_20_RKNEN7_MASK        (0x80U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN7_SHIFT       (7U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN7_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_20_RKNEN7(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_20_RKNEN7_SHIFT)) & CPE_VFCCU_FHIMRKC0_20_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_30 - Immediate Reaction Configuration */
/*! @{ */

#define CPE_VFCCU_FHIMRKC0_30_RKNEN0_MASK        (0x1U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN0_SHIFT       (0U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN0_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN0(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_30_RKNEN0_SHIFT)) & CPE_VFCCU_FHIMRKC0_30_RKNEN0_MASK)

#define CPE_VFCCU_FHIMRKC0_30_RKNEN1_MASK        (0x2U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN1_SHIFT       (1U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN1_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN1(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_30_RKNEN1_SHIFT)) & CPE_VFCCU_FHIMRKC0_30_RKNEN1_MASK)

#define CPE_VFCCU_FHIMRKC0_30_RKNEN2_MASK        (0x4U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN2_SHIFT       (2U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN2_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_30_RKNEN2(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_30_RKNEN2_SHIFT)) & CPE_VFCCU_FHIMRKC0_30_RKNEN2_MASK)

