zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_VFCCU.h
/*! @name FHIMRKC0_60 - Immediate Reaction Configuration */
/*! @{ */

#define CPE_VFCCU_FHIMRKC0_60_RKNEN0_MASK        (0x1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN0_SHIFT       (0U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN0_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN0(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN0_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN0_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN1_MASK        (0x2U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN1_SHIFT       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN1_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN1(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN1_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN1_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN2_MASK        (0x4U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN2_SHIFT       (2U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN2_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN2(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN2_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN2_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN3_MASK        (0x8U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN3_SHIFT       (3U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN3_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN3(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN3_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN3_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN4_MASK        (0x10U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN4_SHIFT       (4U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN4_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN4(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN4_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN4_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN5_MASK        (0x20U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN5_SHIFT       (5U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN5_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN5(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN5_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN5_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN6_MASK        (0x40U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN6_SHIFT       (6U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN6_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN6(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN6_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN6_MASK)

#define CPE_VFCCU_FHIMRKC0_60_RKNEN7_MASK        (0x80U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN7_SHIFT       (7U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN7_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_60_RKNEN7(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_60_RKNEN7_SHIFT)) & CPE_VFCCU_FHIMRKC0_60_RKNEN7_MASK)
/*! @} */

/*! @name FHIMRKC0_70 - Immediate Reaction Configuration */
/*! @{ */

#define CPE_VFCCU_FHIMRKC0_70_RKNEN0_MASK        (0x1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN0_SHIFT       (0U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN0_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN0(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN0_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN0_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN1_MASK        (0x2U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN1_SHIFT       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN1_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN1(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN1_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN1_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN2_MASK        (0x4U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN2_SHIFT       (2U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN2_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN2(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN2_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN2_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN3_MASK        (0x8U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN3_SHIFT       (3U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN3_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN3(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN3_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN3_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN4_MASK        (0x10U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN4_SHIFT       (4U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN4_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN4(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN4_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN4_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN5_MASK        (0x20U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN5_SHIFT       (5U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN5_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN5(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN5_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN5_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN6_MASK        (0x40U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN6_SHIFT       (6U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN6_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN6(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN6_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN6_MASK)

#define CPE_VFCCU_FHIMRKC0_70_RKNEN7_MASK        (0x80U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN7_SHIFT       (7U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN7_WIDTH       (1U)
#define CPE_VFCCU_FHIMRKC0_70_RKNEN7(x)          (((uint32_t)(((uint32_t)(x)) << CPE_VFCCU_FHIMRKC0_70_RKNEN7_SHIFT)) & CPE_VFCCU_FHIMRKC0_70_RKNEN7_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CPE_VFCCU_Register_Masks */

/*!
 * @}
 */ /* end of group CPE_VFCCU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CPE_VFCCU_H_) */
